app/controllers/brokers_controller.rb

SELECT "brokers".* FROM "brokers"
---
  def index
    @brokers = Broker.all

SELECT  "brokers".* FROM "brokers" WHERE "brokers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_broker
      @broker = Broker.find(params[:id])